# Вычислить значение выражения

# Уровень 4 * (дополнительная задача, сдавать не обязательно)
# Действия разделяются скобками
# (12 - 4) * 2

n = '((12 - 4) + 80 / (2 * 2)) + 22 + 2**3'

print(eval(n))
