# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. 
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.

s = int(input('S: '))
p = int(input('P: '))
x = 1
y = s - x
while True:
    if (x * y) != p:
        x += 1
        y -= 1
    else:
        print(s, p, '->', x, y)
        break
